
&НаКлиенте
Процедура СоздатьЭлементы(Команда)
	СоздатьЭлементыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыНаСервере()
	//сначала генерируем группы и формируем соответствие
	
	Соответствие = Новый Соответствие;
	Для ы = 1 по Объект.КоличествоГрупп Цикл
		мНаименование = "Группа" + ы;
		мНоменклатура = Справочники.Номенклатура.НайтиПоНаименованию(мНаименование);
		Если НЕ ЗначениеЗаполнено(мНоменклатура) Тогда
			нГруппа = Справочники.Номенклатура.СоздатьГруппу();
			нГруппа.Наименование = мНаименование;
			нГруппа.Записать();
			мНоменклатура = нГруппа.Ссылка;
		КонецЕсли;
		Соответствие.Вставить(ы, мНоменклатура); 
	КонецЦикла;
	
	//теперь генерируем элементы
	Генератор = Новый ГенераторСлучайныхЧисел();
	Для ы = 1 по Объект.КоличествоЭлементов Цикл
		
		мНаименование = "Элемент " + ы;
		мНоменклатура = Справочники.Номенклатура.НайтиПоНаименованию(мНаименование);
		Если Не ЗначениеЗаполнено(мНоменклатура) Тогда
			нЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
			нЭлемент.Наименование = мНаименование;

			НомерГруппы = Генератор.СлучайноеЧисло(1, Объект.КоличествоГрупп);
			нЭлемент.Родитель = Соответствие.Получить(НомерГруппы);
			нЭлемент.Записать();
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры


