
&НаКлиенте
Процедура СоздатьЭлементы(Команда)
	СоздатьЭлементыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементыНаСервере()
	//сначала генерируем группы и формируем соответствие
	
	Соответствие = Новый Соответствие;
	Для ы = 1 по Объект.КоличествоГрупп Цикл
		нГруппа = Справочники.Номенклатура.СоздатьГруппу();
		нГруппа.Наименование = "Группа" + ы;
		нГруппа.Записать();
		Соответствие.Вставить(ы, нГруппа.Ссылка); 
	КонецЦикла;
	
	//теперь генерируем элементы
	Генератор = Новый ГенераторСлучайныхЧисел(Объект.КоличествоГрупп);
	Для ы = 1 по Объект.КоличествоЭлементов Цикл
		нЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
		нЭлемент.Наименование = "Элемент " + ы;
		
		НомерГруппы = Генератор.СлучайноеЧисло();
		нЭлемент.Родитель = Соответствие.Получить(НомерГруппы);
		нЭлемент.Записать();
	КонецЦикла;	

КонецПроцедуры


