#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции
// Получает таблицу по товарам для проведения.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка.Оприходование - Ссылка на документ.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица по товарам для проведения.
//
Функция ПолучитьТаблицуПоТоварам(ДокументСсылка) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Товары.Ссылка.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Товары.Ссылка КАК Документ,
	|	Товары.Ссылка.Склад КАК Склад,
	|	Товары.Ссылка.СкладПоступления КАК СкладПоступления,
	|	Товары.Номенклатура КАК Номенклатура,
	|	СУММА(Товары.Количество) КАК Количество
	|ИЗ
	|	Документ.Перемещение.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &ДокументСсылка
	|СГРУППИРОВАТЬ ПО
	|	Товары.Ссылка.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Товары.Ссылка,
	|	Товары.Ссылка.Склад,
	|	Товары.Номенклатура,
	|	Товары.Ссылка.СкладПоступления";
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
#КонецОбласти

#КонецЕсли