#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда // Ввод нового.
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения()
	Движения.ТоварыКПоступлениюНаСклад.Записывать = Истина;
	Движения.ТоварыКРасходуСоСклада.Записывать = Истина;

	ТаблицаДвижений = Документы.Перемещение.ПолучитьТаблицуПоТоварам(Ссылка);
	
	Движения.ТоварыКРасходуСоСклада.Загрузить(ТаблицаДвижений);
	
	ТаблицаДвижений.Колонки.Удалить("Склад");
	ТаблицаДвижений.Колонки.СкладПоступления.Имя = "Склад";
	
	Движения.ТоварыКПоступлениюНаСклад.Загрузить(ТаблицаДвижений);
	

	РегистрыСведений.СтатусыСкладскихДокументов.ОпределитьСтатусДокумента(Ссылка);
КонецПроцедуры
#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли