#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда // Ввод нового.
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ТоварыКРасходуСоСклада.Записывать = Истина;

	ТаблицаДвижений = Документы.Списание.ПолучитьТаблицуПоТоварам(Ссылка);
	
	Документы.Списание.ВыполнитьКонтроль(ТаблицаДвижений, Отказ);
	
	Если НЕ Отказ Тогда	
		Движения.ТоварыКРасходуСоСклада.Загрузить(ТаблицаДвижений);
		РегистрыСведений.СтатусыСкладскихДокументов.ОпределитьСтатусДокумента(Ссылка);
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли