#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда // Ввод нового.
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения()
	Движения.ТоварыКРасходуСоСклада.Записывать = Истина;

	ТаблицаДвижений = Документы.Списание.ПолучитьТаблицуПоТоварам(Ссылка);
	
	Движения.ТоварыКРасходуСоСклада.Загрузить(ТаблицаДвижений);

	РегистрыСведений.СтатусыСкладскихДокументов.ОпределитьСтатусДокумента(Ссылка);

КонецПроцедуры
#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли