Функция ИнициализацияПросмотр(Адрес) Экспорт
	СтруктураРезультат = Новый Структура();
	СтруктураРезультат.Вставить("Успех", Ложь);
	СтруктураРезультат.Вставить("ОписаниеОшибки", "");
	
	СтруктураРезультатВыполнения = ЛогистикаСинхронизацияСервер.СоздатьКлиентАдминистрирования();
	Если Не СтруктураРезультатВыполнения.Успех Тогда
		СтруктураРезультат.ОписаниеОшибки = СтруктураРезультатВыполнения.ОписаниеОшибки;	
		Возврат СтруктураРезультат;
	КонецЕсли;
		
	СтруктураРезультатВыполнения = ЛогистикаСинхронизацияСервер.ИнициализироватьКлиентАдминистрирования(Адрес);
	Если Не СтруктураРезультатВыполнения.Успех Тогда   
		СтруктураРезультат.ОписаниеОшибки = СтруктураРезультатВыполнения.ОписаниеОшибки;	
		Возврат СтруктураРезультат;
	КонецЕсли;
	
	СтруктураРезультат.Успех = Истина;
	Возврат СтруктураРезультат;	
	
КонецФункции