#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	ПроверитьПодключениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	ВыгрузитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	ЗагрузитьДанныеНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	СтруктураРезультатВыполнения = ЛогистикаСинхронизацияСервер.ИнициализацияПросмотр(Объект.АдресСервера);    
	Если СтруктураРезультатВыполнения.Успех Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Подключение успешно установлено");
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка: " + СтруктураРезультатВыполнения.ОписаниеОшибки);	
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьДанныеНаСервере()
	Если Объект.Назначение = Перечисления.НазначениеУзлаОбмена.Справочники Тогда
		ЛогистикаСинхронизацияСервер.ВыгрузитьСправочникиНаСервер();
	ИначеЕсли Объект.Назначение = Перечисления.НазначениеУзлаОбмена.Документы Тогда
		ЛогистикаСинхронизацияСервер.ВыгрузитьДокументыНаСервер();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеНаСервере()
	Если Объект.Назначение = Перечисления.НазначениеУзлаОбмена.Справочники Тогда
		ЛогистикаСинхронизацияСервер.ЗагрузитьСправочникиССервера();
	ИначеЕсли Объект.Назначение = Перечисления.НазначениеУзлаОбмена.Документы Тогда 
		ЛогистикаСинхронизацияСервер.ЗагрузитьДокументыССервера();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

