#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	ПроверитьПодключениеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанные(Команда)
	
	Если Объект.Назначение = ПредопределенноеЗначение("Перечисление.НазначениеУзлаОбмена.Справочники") И НЕ Объект.ЦентральныйОфис Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выгрузка справочников из подчиненной базы не предусмротрена");
		Возврат;
	КонецЕсли;
	
	ВыгрузитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанные(Команда)
	ЗагрузитьДанныеНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	СтруктураРезультатВыполнения = ЛогистикаСинхронизацияСервер.ИнициализацияПросмотр(Объект.АдресСервера);    
	Если СтруктураРезультатВыполнения.Успех Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Подключение успешно установлено");
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка: " + СтруктураРезультатВыполнения.ОписаниеОшибки);	
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьДанныеНаСервере()
	Если Объект.Назначение = Перечисления.НазначениеУзлаОбмена.Справочники Тогда
		СтруктураРезультат = ЛогистикаСинхронизацияСервер.ВыгрузитьСправочникиНаСервер();
		Если СтруктураРезультат.Успех Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выгрузка справочников успешно завершена");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка: " + СтруктураРезультат.ОписаниеОшибки);	
		КонецЕсли;
	ИначеЕсли Объект.Назначение = Перечисления.НазначениеУзлаОбмена.Документы Тогда
		СтруктураРезультат = ЛогистикаСинхронизацияСервер.ВыгрузитьДокументыНаСервер();
		Если СтруктураРезультат.Успех Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выгрузка документов успешно завершена");
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка: " + СтруктураРезультат.ОписаниеОшибки);	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеНаСервере()
	Если Объект.Назначение = Перечисления.НазначениеУзлаОбмена.Справочники Тогда
		ЛогистикаСинхронизацияСервер.ЗагрузитьСправочникиССервера();
	ИначеЕсли Объект.Назначение = Перечисления.НазначениеУзлаОбмена.Документы Тогда 
		ЛогистикаСинхронизацияСервер.ЗагрузитьДокументыССервера();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

