#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты.ДобавитьТестовыйНабор("Складские операции").ВТранзакции()
		.ДобавитьТест("ОпределитьРасчетныйСтатусНовый")
		.ДобавитьТест("ОпределитьРасчетныйСтатусПодготовлен")
		.ДобавитьТест("ОпределитьРасчетныйСтатусЗавершен")
	;
	
КонецПроцедуры

Процедура ОпределитьРасчетныйСтатусНовый() Экспорт
	
	НоваяНоменклатура = ЮТест.Данные().КонструкторОбъекта("Справочник.Номенклатура")
						.ФикцияОбязательныхПолей()
						.Установить("Наименование", "Товар1")
						.Записать();
						
	НовыйСклад = ЮТест.Данные().КонструкторОбъекта("Справочник.Склады")
						.ФикцияОбязательныхПолей()
						.Установить("Наименование", "Склад1")
						.Записать();
	
	ДокументОприходования = ЮТест.Данные().КонструкторОбъекта("Документ.Оприходование")
						.ФикцияОбязательныхПолей()
						.Установить("Дата", ТекущаяДатаСеанса())
						.Установить("Склад", НовыйСклад)
						.ТабличнаяЧасть("Товары")
							.ДобавитьСтроку()
								.Установить("Номенклатура", НоваяНоменклатура)
								.Установить("Количество", 10)
						.Провести();
						
	РасчетныйСтатус = РегистрыСведений.СтатусыСкладскихДокументов.ОпределитьРасчетныйСтатус(ДокументОприходования);
	
	ЮТест.ОжидаетЧто(РасчетныйСтатус)
			.ИмеетТип("ПеречислениеСсылка.СтатусыСкладскихДокументов")
			.Равно(Перечисления.СтатусыСкладскихДокументов.Новый);				
КонецПроцедуры

Процедура ОпределитьРасчетныйСтатусПодготовлен() Экспорт
	
	НоваяНоменклатура = ЮТест.Данные().КонструкторОбъекта("Справочник.Номенклатура")
						.ФикцияОбязательныхПолей()
						.Установить("Наименование", "Товар1")
						.Записать();
						
	НовыйСклад = ЮТест.Данные().КонструкторОбъекта("Справочник.Склады")
						.ФикцияОбязательныхПолей()
						.Установить("Наименование", "Склад1")
						.Записать();
	
	ДокументОприходования = ЮТест.Данные().КонструкторОбъекта("Документ.Оприходование")
						.ФикцияОбязательныхПолей()
						.Установить("Дата", ТекущаяДатаСеанса())
						.Установить("Склад", НовыйСклад)
						.ТабличнаяЧасть("Товары")
							.ДобавитьСтроку()
								.Установить("Номенклатура", НоваяНоменклатура)
								.Установить("Количество", 10)
						.Провести();
						
	ДокументПОТ = ЮТест.Данные().КонструкторОбъекта("Документ.ПриходныйОрдер")
						.ФикцияОбязательныхПолей()
						.Установить("Дата", ТекущаяДатаСеанса())
						.Установить("Склад", НовыйСклад)
						.Установить("ДокументОснование", ДокументОприходования)
						.Установить("Выполнен", Ложь)
						.ТабличнаяЧасть("Товары")
							.ДобавитьСтроку()
								.Установить("Номенклатура", НоваяНоменклатура)
								.Установить("Количество", 10)
						.Провести();

	РасчетныйСтатус = РегистрыСведений.СтатусыСкладскихДокументов.ОпределитьРасчетныйСтатус(ДокументОприходования);
	
	ЮТест.ОжидаетЧто(РасчетныйСтатус)
			.ИмеетТип("ПеречислениеСсылка.СтатусыСкладскихДокументов")
			.Равно(Перечисления.СтатусыСкладскихДокументов.Подготовлен);
				
КонецПроцедуры

Процедура ОпределитьРасчетныйСтатусЗавершен() Экспорт
	
	НоваяНоменклатура = ЮТест.Данные().КонструкторОбъекта("Справочник.Номенклатура")
						.ФикцияОбязательныхПолей()
						.Установить("Наименование", "Товар1")
						.Записать();
						
	НовыйСклад = ЮТест.Данные().КонструкторОбъекта("Справочник.Склады")
						.ФикцияОбязательныхПолей()
						.Установить("Наименование", "Склад1")
						.Записать();
	
	ДокументОприходования = ЮТест.Данные().КонструкторОбъекта("Документ.Оприходование")
						.ФикцияОбязательныхПолей()
						.Установить("Дата", ТекущаяДатаСеанса())
						.Установить("Склад", НовыйСклад)
						.ТабличнаяЧасть("Товары")
							.ДобавитьСтроку()
								.Установить("Номенклатура", НоваяНоменклатура)
								.Установить("Количество", 10)
						.Провести();
						
	ДокументПОТ = ЮТест.Данные().КонструкторОбъекта("Документ.ПриходныйОрдер")
						.ФикцияОбязательныхПолей()
						.Установить("Дата", ТекущаяДатаСеанса())
						.Установить("Склад", НовыйСклад)
						.Установить("ДокументОснование", ДокументОприходования)
						.Установить("Выполнен", Истина)
						.ТабличнаяЧасть("Товары")
							.ДобавитьСтроку()
								.Установить("Номенклатура", НоваяНоменклатура)
								.Установить("Количество", 10)
						.Провести();

	РасчетныйСтатус = РегистрыСведений.СтатусыСкладскихДокументов.ОпределитьРасчетныйСтатус(ДокументОприходования);
	
	ЮТест.ОжидаетЧто(РасчетныйСтатус)
			.ИмеетТип("ПеречислениеСсылка.СтатусыСкладскихДокументов")
			.Равно(Перечисления.СтатусыСкладскихДокументов.Завершен);				
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
