#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда // Ввод нового.
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ТоварыКПоступлениюНаСклад.Записывать = Истина;

	ТаблицаДвижений = Документы.Оприходование.ПолучитьТаблицуПоТоварам(Ссылка);
	
	Движения.ТоварыКПоступлениюНаСклад.Загрузить(ТаблицаДвижений);

	РегистрыСведений.СтатусыСкладскихДокументов.ОпределитьСтатусДокумента(Ссылка);
КонецПроцедуры
#КонецОбласти

#Иначе
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли